Tekla Open API Reference for Tekla Structures 2025
Plugin.ApplyStandardValues Method
 Applies the values of the specified file as the default values for the dialog belonging to this plug-in. This will affect each Insert call of the plug-ins with the same name.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool ApplyStandardValues(
	string Filename
)
Public Function ApplyStandardValues (
	Filename As String
) As Boolean
Parameters
Filename
Type: System.String
The short name of the file containing the attributes.
Return Value
Type: Boolean
True on success. Otherwise, false.
See Also
Reference
Plugin Class
Tekla.Structures.Drawing Namespace